[
  {
    "title": "Levels of Organization in the Human Body",
    "content": "This lesson explores the hierarchical organization of the human body, from cells to tissues, organs, organ systems, and the organism as a whole. It emphasizes the interconnectedness of these levels and how they contribute to overall physiological function."
  },
  {
    "title": "Anatomical Terminology",
    "content": "Understanding anatomical terminology is crucial for effective communication in the health sciences. This lesson introduces standard anatomical position, directional terms (e.g., superior, inferior, anterior, posterior), regional terms, body planes (sagittal, frontal, transverse), and body cavities."
  },
  {
    "title": "The Integumentary System",
    "content": "The integumentary system, consisting of the skin, hair, nails, and exocrine glands, serves as a protective barrier, regulates body temperature, and provides sensory information. This lesson delves into the structure and functions of the epidermis, dermis, and hypodermis, as well as common skin conditions."
  },
  {
    "title": "The Skeletal System: Bones and Joints",
    "content": "This lesson focuses on the structure and function of the skeletal system. It covers bone classification, histology of bone tissue, bone development and growth (ossification), major bones of the axial and appendicular skeleton, and the different types of joints (synovial, fibrous, cartilaginous) and their movements."
  },
  {
    "title": "The Muscular System",
    "content": "The muscular system is responsible for movement, posture, and heat generation. This lesson examines the three types of muscle tissue (skeletal, smooth, and cardiac), the macroscopic and microscopic anatomy of skeletal muscles, the mechanism of muscle contraction (sliding filament theory), and the naming of major skeletal muscles."
  },
  {
    "title": "The Nervous System: Brain and Spinal Cord",
    "content": "This lesson introduces the central nervous system (CNS), focusing on the brain and spinal cord. It covers the major divisions of the brain (cerebrum, cerebellum, brainstem), their respective functions, the protective structures of the CNS (meninges, cerebrospinal fluid), and the basic organization of the spinal cord and spinal nerves."
  },
  {
    "title": "The Cardiovascular System",
    "content": "The cardiovascular system, comprising the heart, blood vessels, and blood, is vital for transporting nutrients, oxygen, and waste products throughout the body. This lesson explores the anatomy of the heart (chambers, valves, major vessels), the systemic and pulmonary circuits, the different types of blood vessels (arteries, veins, capillaries), and the components of blood."
  }
]
