[
  {
    "title": "The Structure of Eukaryotic Cells",
    "content": "This lesson provides a detailed overview of the eukaryotic cell, focusing on the structure and function of its various organelles. Topics include the nucleus (chromatin, nucleolus, nuclear envelope), endoplasmic reticulum (rough and smooth), Golgi apparatus, lysosomes, peroxisomes, mitochondria, and the cytoskeleton (microtubules, microfilaments, intermediate filaments). Plant cell specific structures like chloroplasts, cell wall, and vacuoles will also be discussed."
  },
  {
    "title": "The Cell Membrane and Transport",
    "content": "The cell membrane is a dynamic barrier that regulates the passage of substances into and out of the cell. This lesson explores the fluid mosaic model of membrane structure, the roles of lipids, proteins, and carbohydrates in membrane function, and the different mechanisms of membrane transport: passive diffusion, facilitated diffusion, osmosis, active transport (primary and secondary), and vesicular transport (endocytosis and exocytosis)."
  },
  {
    "title": "Cellular Respiration and Energy Production",
    "content": "This lesson focuses on how cells extract energy from organic molecules, primarily glucose, through cellular respiration. It details the major stages: glycolysis (in the cytoplasm), pyruvate oxidation and the citric acid cycle (in the mitochondrial matrix), and oxidative phosphorylation (electron transport chain and chemiosmosis in the inner mitochondrial membrane). The roles of ATP and electron carriers (NAD+ and FAD) will be emphasized."
  },
  {
    "title": "Photosynthesis",
    "content": "This lesson covers the process of photosynthesis, by which light energy is converted into chemical energy in the form of organic compounds, primarily in plants and algae. It examines the light-dependent reactions (photophosphorylation, oxygen evolution) occurring in the thylakoid membranes of chloroplasts and the Calvin cycle (carbon fixation) occurring in the stroma."
  },
  {
    "title": "The Cell Cycle and Mitosis",
    "content": "The cell cycle is the ordered sequence of events that leads to cell division. This lesson describes the phases of the cell cycle (Interphase: G1, S, G2; and Mitotic phase: Mitosis and Cytokinesis). It provides a detailed examination of the stages of mitosis (prophase, prometaphase, metaphase, anaphase, telophase) and the regulation of the cell cycle by checkpoints and cyclins/CDKs."
  },
  {
    "title": "Meiosis and Genetic Variation",
    "content": "Meiosis is a specialized type of cell division that produces haploid gametes for sexual reproduction. This lesson contrasts meiosis with mitosis, detailing the stages of Meiosis I and Meiosis II. It emphasizes how processes like crossing over (in Prophase I) and independent assortment (in Metaphase I) contribute to genetic variation in offspring."
  },
  {
    "title": "DNA Replication and Protein Synthesis",
    "content": "This lesson covers the central dogma of molecular biology. It explains the process of DNA replication, ensuring faithful transmission of genetic information. It then details protein synthesis, including transcription (synthesis of mRNA from a DNA template) and translation (synthesis of a polypeptide chain from mRNA by ribosomes), including the role of tRNA and the genetic code."
  }
]
