[
  {
    "title": "Innate Immunity: First Line of Defense",
    "content": "This lesson explores the components and mechanisms of the innate immune system, which provides immediate, non-specific defense against pathogens. Topics include physical barriers (skin, mucous membranes), phagocytic cells (neutrophils, macrophages), natural killer (NK) cells, antimicrobial proteins (lysozyme, defensins), inflammation, and the fever response."
  },
  {
    "title": "Adaptive Immunity: Specificity and Memory",
    "content": "The adaptive immune system provides a highly specific and long-lasting defense. This lesson introduces the key features of adaptive immunity: specificity, diversity, memory, and self/non-self recognition. It outlines the two main branches: humoral immunity (mediated by B cells and antibodies) and cell-mediated immunity (mediated by T cells)."
  },
  {
    "title": "Antigens, Antibodies, and B-Cell Activation",
    "content": "This lesson focuses on the molecular players in humoral immunity. It defines antigens and epitopes, details the structure and classes of antibodies (immunoglobulins: IgG, IgM, IgA, IgD, IgE) and their functions (neutralization, opsonization, complement activation). It also covers B-cell development, clonal selection, and activation leading to antibody production by plasma cells and memory B-cell formation."
  },
  {
    "title": "T-Cell Development and Activation",
    "content": "T lymphocytes are central to cell-mediated immunity and also help regulate humoral immunity. This lesson covers T-cell development in the thymus (positive and negative selection), the T-cell receptor (TCR), Major Histocompatibility Complex (MHC) molecules (Class I and Class II) and antigen presentation. It further explains the activation of cytotoxic T cells (CD8+) and helper T cells (CD4+), and their respective roles in eliminating infected cells and coordinating immune responses."
  },
  {
    "title": "The Complement System",
    "content": "The complement system is a cascade of plasma proteins that 'complements' the action of antibodies and phagocytic cells to clear pathogens. This lesson describes the classical, alternative, and lectin pathways of complement activation, and the outcomes of activation: opsonization, inflammation, and cell lysis (via the membrane attack complex)."
  },
  {
    "title": "Immunological Disorders: Autoimmunity and Hypersensitivity",
    "content": "This lesson discusses dysfunctions of the immune system. It covers autoimmunity, where the immune system mistakenly attacks self-tissues (e.g., rheumatoid arthritis, lupus, type 1 diabetes). It also explores hypersensitivity reactions (Types I-IV), which are exaggerated or inappropriate immune responses to antigens (allergens, pathogens, self-antigens), such as allergies and asthma."
  },
  {
    "title": "Vaccines and Immunization",
    "content": "Vaccination is a powerful tool for preventing infectious diseases by inducing immunological memory. This lesson explains the principles of immunization, different types of vaccines (live-attenuated, inactivated, subunit, toxoid, mRNA), and their mechanisms of action. It also touches upon herd immunity and the importance of vaccination programs."
  }
]
