[
  {
    "title": "Calculus: Limits and Derivatives",
    "content": "This lesson introduces the fundamental concepts of calculus, starting with the intuitive idea of a limit. It covers formal definitions of limits, limit laws, continuity, and the concept of the derivative as a rate of change and the slope of a tangent line. Techniques for finding derivatives of polynomial, exponential, logarithmic, and trigonometric functions, as well as the product, quotient, and chain rules, will be explored."
  },
  {
    "title": "Calculus: Integration Techniques",
    "content": "Integration is the reverse process of differentiation and is used to find areas, volumes, and accumulated change. This lesson covers the definite and indefinite integral, the Fundamental Theorem of Calculus, and various techniques of integration, including u-substitution, integration by parts, trigonometric substitution, and partial fraction decomposition."
  },
  {
    "title": "Linear Algebra: Vectors and Matrices",
    "content": "Linear algebra deals with vector spaces and linear mappings between them. This lesson introduces vectors in Euclidean space (Rn), vector operations (addition, scalar multiplication, dot product, cross product), matrix operations (addition, scalar multiplication, matrix multiplication, transpose), and special types of matrices (identity, diagonal, symmetric)."
  },
  {
    "title": "Linear Algebra: Systems of Linear Equations",
    "content": "Solving systems of linear equations is a core problem in linear algebra. This lesson covers representing systems of equations using augmented matrices, Gaussian elimination (row reduction) to solve systems, the concepts of rank, consistency, and uniqueness of solutions, matrix inverses, and determinants and their application to solving systems (Cramer's Rule)."
  },
  {
    "title": "Probability and Statistics: Basic Concepts",
    "content": "This lesson introduces the foundational concepts of probability and statistics. It covers sample spaces, events, probability axioms, conditional probability, Bayes' theorem, random variables (discrete and continuous), expected value, variance, and common probability distributions (binomial, Poisson, normal)."
  },
  {
    "title": "Statistics: Hypothesis Testing",
    "content": "Hypothesis testing is a crucial statistical method for making decisions based on data. This lesson explains the framework of hypothesis testing: null and alternative hypotheses, Type I and Type II errors, significance level (alpha), p-values, and test statistics. It will cover common tests like t-tests (one-sample, two-sample, paired) and chi-squared tests for categorical data."
  },
  {
    "title": "Differential Equations: Introduction",
    "content": "Differential equations relate a function with its derivatives and are fundamental to modeling real-world phenomena. This lesson introduces basic concepts: order and linearity of differential equations, initial value problems, and solution techniques for first-order ordinary differential equations, including separable equations, linear equations (using integrating factors), and exact equations."
  }
]
