[
  {
    "title": "Homeostasis and Control Systems",
    "content": "This lesson introduces the concept of homeostasis, the maintenance of a stable internal environment, which is fundamental to physiology. It explores negative and positive feedback mechanisms, and the components of control systems (receptors, control centers, effectors) that regulate physiological variables."
  },
  {
    "title": "Cell Physiology: Transport and Signaling",
    "content": "This lesson delves into the physiological processes occurring at the cellular level. It covers membrane transport mechanisms (diffusion, osmosis, active transport, vesicular transport) and cell signaling pathways (receptor types, signal transduction) that enable cells to communicate and respond to their environment."
  },
  {
    "title": "Neurophysiology: Nerve Impulses and Synaptic Transmission",
    "content": "Building on anatomical knowledge of the nervous system, this lesson focuses on its functional aspects. It explains the generation and propagation of action potentials (nerve impulses), the role of ion channels, and the process of synaptic transmission, including neurotransmitter release and receptor binding."
  },
  {
    "title": "Muscle Physiology: Contraction Mechanisms",
    "content": "This lesson explores the physiological mechanisms underlying muscle contraction. It details the sliding filament theory, the roles of calcium and ATP, excitation-contraction coupling, and the factors influencing muscle force and fatigue. It also differentiates the contractile properties of skeletal, smooth, and cardiac muscle."
  },
  {
    "title": "Cardiovascular Physiology: Blood Flow and Pressure Regulation",
    "content": "This lesson examines the dynamics of blood circulation. It covers cardiac output, stroke volume, heart rate, factors affecting blood flow (pressure gradients, resistance), regulation of blood pressure (baroreceptor reflex, hormonal controls), and microcirculation."
  },
  {
    "title": "Respiratory Physiology: Gas Exchange and Transport",
    "content": "Focusing on the functional aspects of the respiratory system, this lesson explains the mechanics of breathing (ventilation), principles of gas exchange in the alveoli (partial pressures, diffusion), transport of oxygen and carbon dioxide in the blood, and neural and chemical regulation of respiration."
  },
  {
    "title": "Renal Physiology: Filtration and Excretion",
    "content": "This lesson covers the physiological processes by which the kidneys maintain fluid and electrolyte balance and excrete metabolic wastes. It details glomerular filtration, tubular reabsorption, tubular secretion, and the concentration of urine, as well as the role of hormones like ADH and aldosterone in renal function."
  }
]
