[
    {
        "title": "Options: Call vs. Put - Basic Goals",
        "content": "<h3>Foundation: Rights & Obligations</h3><p>Options contracts grant rights but not obligations (for buyers) or create obligations (for sellers/writers).</p><ul><li><strong>Call Option:</strong> Gives the buyer the <em>right</em> (not obligation) to <strong>buy</strong> the underlying asset (e.g., 100 shares of stock) at a specified price (<strong>strike price</strong>) on or before a specific date (<strong>expiration</strong>). Buyer pays a <strong>premium</strong>. Seller receives premium, obligated to sell if assigned.</li><li><strong>Put Option:</strong> Gives the buyer the <em>right</em> (not obligation) to <strong>sell</strong> the underlying asset at the strike price on or before expiration. Buyer pays premium. Seller receives premium, obligated to buy if assigned.</li></ul><h3>Basic Goals:</h3><ul><li><strong>Buying Calls:</strong> Goal is often leveraged bullish speculation (profit if underlying price rises significantly). Max loss = premium paid.</li><li><strong>Buying Puts:</strong> Goal is often leveraged bearish speculation or hedging (profit if underlying price falls significantly). Max loss = premium paid.</li></ul><h3>Takeaway:</h3><p>Understand the fundamental right/obligation difference and the basic directional goals of buying calls vs. puts. Premium paid is the buyer's maximum risk.</p>"
    },
    {
        "title": "Options: Intrinsic vs. Extrinsic Value",
        "content": "<h3>Premium Components:</h3><p>The price (premium) of an option is composed of intrinsic and extrinsic value.</p><ul><li><strong>Intrinsic Value:</strong> The amount an option is 'in-the-money' (ITM). It's the tangible value if exercised immediately. <br> - Call Intrinsic Value = <code>MAX(0, Underlying Price - Strike Price)</code><br> - Put Intrinsic Value = <code>MAX(0, Strike Price - Underlying Price)</code><br> - Out-of-the-money (OTM) or At-the-money (ATM) options have <strong>zero</strong> intrinsic value.</li><li><strong>Extrinsic Value (Time Value):</strong> The portion of the premium above intrinsic value. Represents the chance the option could become profitable (or more profitable) before expiration. Influenced by time remaining (<strong>Theta</strong>) and expected future volatility (<strong>Vega</strong>).</li></ul><h3>Goal Relevance:</h3><p>Buyers pay for both; sellers collect both. Understanding the components helps assess if an option is 'cheap' or 'expensive' relative to its potential and time decay.</p><h3>Takeaway:</h3><p>Premium = Intrinsic Value + Extrinsic Value. Extrinsic value decays over time and is sensitive to volatility changes.</p>"
    },
    {
        "title": "Options Strategy: Covered Call (Goal: Income)",
        "content": "<h3>Strategy Goal:</h3><p>Generate income (premium) from stock you already own, while potentially capping upside gains.</p><h3>Setup:</h3><ol><li>Own at least 100 shares of the underlying stock (e.g., XYZ).</li><li><strong>Sell (Write) 1 Call option contract</strong> against those shares, typically with a strike price above the current stock price (OTM) and a chosen expiration date.</li></ol><h3>Mechanism:</h3><p>You receive premium for selling the call. Your obligation is to sell your 100 shares at the strike price if the stock price is above the strike at expiration and you are assigned.</p><h3>Outcomes:</h3><ul><li><strong>Stock below Strike at Expiration:</strong> Call expires worthless. You keep the premium and your shares. Goal achieved. Repeat if desired.</li><li><strong>Stock above Strike at Expiration:</strong> Call is ITM. You'll likely be assigned, selling your shares at the strike price. You keep the premium. Your upside profit on the stock is capped at the strike price.</li></ul><h3>Risk:</h3><p>Downside risk remains on the stock ownership (partially offset by the premium received). Upside potential on the stock is limited.</p><h3>Takeaway:</h3><p>Covered calls trade potential stock upside for premium income. Suitable if neutral to mildly bullish on the stock long-term up to the strike price.</p>"
    },
     {
        "title": "Options Strategy: Cash-Secured Put (Goal: Acquisition/Income)",
        "content": "<h3>Strategy Goal:</h3><p>Either acquire stock at a price below current market value OR generate income (premium).</p><h3>Setup:</h3><ol><li>Identify a stock you are willing to own at a specific price (the strike price).</li><li>Have enough cash set aside (secured) to buy 100 shares at that strike price. (Cash needed = Strike Price * 100).</li><li><strong>Sell (Write) 1 Put option contract</strong> with the desired strike price and expiration date.</li></ol><h3>Mechanism:</h3><p>You receive premium for selling the put. Your obligation is to buy 100 shares at the strike price if the stock price is below the strike at expiration and you are assigned.</p><h3>Outcomes:</h3><ul><li><strong>Stock above Strike at Expiration:</strong> Put expires worthless. You keep the premium. Goal (income) achieved. No stock assigned.</li><li><strong>Stock below Strike at Expiration:</strong> Put is ITM. You'll likely be assigned, buying 100 shares at the strike price (using your secured cash). You keep the premium. Your effective purchase price is Strike Price - Premium Received. Goal (acquisition at desired price) achieved.</li></ul><h3>Risk:</h3><p>If assigned, you own stock that has fallen below your strike. You could experience further losses if the stock continues to decline.</p><h3>Takeaway:</h3><p>Cash-secured puts allow earning premium while waiting to potentially buy stock at a discount to its price when the put was sold. Only sell puts on stocks you truly want to own at the strike price.</p>"
    },
     {
        "title": "Options Greeks: Delta (Directional Exposure)",
        "content": "<h3>Concept: Sensitivity to Underlying Price</h3><p><strong>Delta (Δ)</strong> measures the expected change in an option's price (premium) for a $1 change in the underlying asset's price. It estimates directional exposure.</p><h3>Interpretation:</h3><ul><li><strong>Call Deltas:</strong> Range from 0 to +1.0. A Delta of 0.60 means the call premium should increase by approx. $0.60 if the stock rises $1.</li><li><strong>Put Deltas:</strong> Range from -1.0 to 0. A Delta of -0.40 means the put premium should increase by approx. $0.40 if the stock falls $1 (or decrease $0.40 if stock rises $1).</li><li>ATM options typically have Deltas around +/- 0.50. ITM options approach +/- 1.0. OTM options approach 0.</li></ul><h3>Goal Relevance:</h3><p>Delta approximates the probability of an option expiring ITM. It helps quantify the directional risk of a position. Portfolio delta sums individual position deltas to show overall directional bias.</p><h3>Takeaway:</h3><p>Delta is the primary Greek for understanding how sensitive your option position is to small moves in the underlying asset's price.</p>"
    },
    {
        "title": "Options Greeks: Theta (Time Decay)",
        "content": "<h3>Concept: Sensitivity to Time</h3><p><strong>Theta (Θ)</strong> measures the expected decrease in an option's price (premium) for a one-day decrease in its time to expiration, assuming all other factors (stock price, volatility) remain constant.</p><h3>Interpretation:</h3><ul><li>Theta is typically expressed as a <strong>negative</strong> number (e.g., -0.05). This means the option is expected to lose $0.05 in value per day due to time decay alone.</li><li>Theta decay accelerates as expiration approaches, especially for ATM options.</li><li>Long options (bought) have negative Theta (lose value over time). Short options (sold) have positive Theta (gain value over time).</li></ul><h3>Goal Relevance:</h3><p>Option buyers fight time decay (Theta is an enemy). Option sellers benefit from time decay (Theta is a friend). Strategies like Iron Condors or Calendars aim to profit primarily from Theta.</p><h3>Takeaway:</h3><p>Theta quantifies the cost (for buyers) or benefit (for sellers) of time passing. It's a crucial factor, especially for strategies held closer to expiration.</p>"
    },
     {
        "title": "Options Greeks: Vega (Volatility Sensitivity)",
        "content": "<h3>Concept: Sensitivity to Implied Volatility</h3><p><strong>Vega (ν)</strong> measures the expected change in an option's price (premium) for a 1% change in the underlying asset's <strong>Implied Volatility (IV)</strong>.</p><h3>Interpretation:</h3><ul><li>Vega is typically positive for both calls and puts. A Vega of 0.10 means the option premium should increase by $0.10 if IV increases by 1 percentage point (e.g., from 30% to 31%).</li><li>Long options (bought) have positive Vega (benefit from rising IV). Short options (sold) have negative Vega (hurt by rising IV).</li><li>ATM and longer-dated options generally have higher Vega.</li></ul><h3>Goal Relevance:</h3><p>Traders expecting volatility to increase might buy options (long Vega). Traders expecting volatility to decrease (e.g., after an earnings event) might sell options (short Vega). Strategies like Straddles/Strangles are long Vega; Iron Condors are short Vega.</p><h3>Takeaway:</h3><p>Vega measures exposure to changes in market expectation of future price swings (Implied Volatility). Essential for volatility-focused strategies.</p>"
    },
    {
        "title": "Options Strategy: Long Vertical Spread (Goal: Defined Risk Directional Bet)",
        "content": "<h3>Concept:</h3><p>Buying one option and simultaneously selling another option of the same type (both calls or both puts) and same expiration, but different strike prices. Limits both max profit and max loss.</p><h3>Types:</h3><ul><li><strong>Debit Spread:</strong> Costs money to enter (net debit). Goal is directional movement. <br> - <em>Bull Call Spread:</em> Buy lower strike call, Sell higher strike call. Max Profit = (Strike Difference - Net Debit). Max Loss = Net Debit. Goal: Stock rises moderately.<br> - <em>Bear Put Spread:</em> Buy higher strike put, Sell lower strike put. Max Profit = (Strike Difference - Net Debit). Max Loss = Net Debit. Goal: Stock falls moderately.</li><li><strong>Credit Spread:</strong> Receive money to enter (net credit). Goal is often for the underlying to NOT move past the short strike. Covered in another lesson.</li></ul><h3>Goal Relevance:</h3><p>Allows a directional bet with strictly defined risk (the net debit paid) and defined profit potential, cheaper than buying an option outright.</p><h3>Takeaway:</h3><p>Vertical debit spreads offer a risk-defined way to express a directional view, reducing cost and volatility exposure compared to buying single options.</p>"
    },
     {
        "title": "Options Strategy: Iron Condor (Goal: Range-Bound/Volatility Selling)",
        "content": "<h3>Concept:</h3><p>A neutral, defined-risk strategy involving four different options contracts (four 'legs'): Selling one OTM Put Spread and simultaneously selling one OTM Call Spread, both with the same expiration.</p><h3>Setup:</h3><ol><li>Sell OTM Put (e.g., Strike A)</li><li>Buy further OTM Put (e.g., Strike B, lower than A)</li><li>Sell OTM Call (e.g., Strike C)</li><li>Buy further OTM Call (e.g., Strike D, higher than C)</li></ol><p>Result: Net Credit received.</p><h3>Goal:</h3><p>Profit if the underlying asset price stays <strong>between</strong> the short strikes (A and C) at expiration. The maximum profit is the initial net credit received.</p><h3>Risk:</h3><p>Maximum loss occurs if the price moves strongly beyond either the higher long call (D) or lower long put (B). Max Loss = (Width of widest spread - Net Credit Received). Risk is defined.</p><h3>Implied Volatility Angle:</h3><p>Often initiated when Implied Volatility is high (selling expensive options), hoping volatility (and option prices) will decrease, benefiting the short premium position (Negative Vega, Positive Theta).</p><h3>Takeaway:</h3><p>Iron Condors are a defined-risk way to profit from low price movement and/or decreasing volatility. Requires the underlying to stay within a specific range.</p>"
    },
    {
        "title": "Options: Assignment Risk & Management",
        "content": "<h3>Concept: Fulfilling the Obligation</h3><p><strong>Assignment</strong> occurs when the buyer of an option exercises their right, forcing the seller (writer) to fulfill their obligation (sell stock for short calls, buy stock for short puts).</p><h3>When Does it Happen?</h3><ul><li>Most likely for ITM options near or at expiration.</li><li>Can happen early for American-style options (most equities), especially for ITM calls just before an ex-dividend date or deep ITM puts.</li></ul><h3>Managing Short Call Assignment Risk:</h3><ul><li><strong>Goal:</strong> Avoid selling stock you want to keep.</li><li><strong>Action:</strong> If the call is ITM near expiration, you can often <strong>Roll</strong> the option (buy back the short call, sell a new call further out in time and/or at a higher strike) or simply buy back the short call to close the position before assignment.</li></ul><h3>Managing Short Put Assignment Risk:</h3><ul><li><strong>Goal:</strong> Avoid buying stock if unwanted / Ensure sufficient cash if wanted.</li><li><strong>Action:</strong> If the put is ITM near expiration, you can Roll the option (buy back short put, sell new put further out/lower strike) or buy back the short put to close. If you *want* the stock (Cash-Secured Put goal), ensure cash is available.</li></ul><h3>Takeaway:</h3><p>Understand when assignment is likely. Proactively manage short ITM positions near expiration by closing or rolling if you don't want assignment to occur.</p>"
    }
]
